MikroElektronika/core_packages/PIC/XC8/def/PIC18F47K40/mcu.h
extern volatile TXSTA2bits_t TXSTA2bits __at(0xE9E);
// bitfield macros
#define _TXSTA2_TX9D_POSN                                   0x0
#define _TXSTA2_TX9D_POSITION                               0x0
#define _TXSTA2_TX9D_SIZE                                   0x1
#define _TXSTA2_TX9D_LENGTH                                 0x1
#define _TXSTA2_TX9D_MASK                                   0x1
#define _TXSTA2_TRMT_POSN                                   0x1
#define _TXSTA2_TRMT_POSITION                               0x1
#define _TXSTA2_TRMT_SIZE                                   0x1
#define _TXSTA2_TRMT_LENGTH                                 0x1
#define _TXSTA2_TRMT_MASK                                   0x2
#define _TXSTA2_BRGH_POSN                                   0x2
#define _TXSTA2_BRGH_POSITION                               0x2
#define _TXSTA2_BRGH_SIZE                                   0x1
#define _TXSTA2_BRGH_LENGTH                                 0x1
#define _TXSTA2_BRGH_MASK                                   0x4
#define _TXSTA2_SENDB_POSN                                  0x3
#define _TXSTA2_SENDB_POSITION                              0x3
#define _TXSTA2_SENDB_SIZE                                  0x1
#define _TXSTA2_SENDB_LENGTH                                0x1
#define _TXSTA2_SENDB_MASK                                  0x8
#define _TXSTA2_SYNC_POSN                                   0x4
#define _TXSTA2_SYNC_POSITION                               0x4
#define _TXSTA2_SYNC_SIZE                                   0x1
#define _TXSTA2_SYNC_LENGTH                                 0x1
#define _TXSTA2_SYNC_MASK                                   0x10
#define _TXSTA2_TXEN_POSN                                   0x5
#define _TXSTA2_TXEN_POSITION                               0x5
#define _TXSTA2_TXEN_SIZE                                   0x1
#define _TXSTA2_TXEN_LENGTH                                 0x1
#define _TXSTA2_TXEN_MASK                                   0x20
#define _TXSTA2_TX9_POSN                                    0x6
#define _TXSTA2_TX9_POSITION                                0x6
#define _TXSTA2_TX9_SIZE                                    0x1
#define _TXSTA2_TX9_LENGTH                                  0x1
#define _TXSTA2_TX9_MASK                                    0x40
#define _TXSTA2_CSRC_POSN                                   0x7
#define _TXSTA2_CSRC_POSITION                               0x7
#define _TXSTA2_CSRC_SIZE                                   0x1
#define _TXSTA2_CSRC_LENGTH                                 0x1
#define _TXSTA2_CSRC_MASK                                   0x80
#define _TXSTA2_TX8_92_POSN                                 0x6
#define _TXSTA2_TX8_92_POSITION                             0x6
#define _TXSTA2_TX8_92_SIZE                                 0x1
#define _TXSTA2_TX8_92_LENGTH                               0x1
#define _TXSTA2_TX8_92_MASK                                 0x40
#define _TXSTA2_TXD82_POSN                                  0x0
#define _TXSTA2_TXD82_POSITION                              0x0
#define _TXSTA2_TXD82_SIZE                                  0x1
#define _TXSTA2_TXD82_LENGTH                                0x1
#define _TXSTA2_TXD82_MASK                                  0x1

// Register: BAUD2CON
#define BAUD2CON BAUD2CON
extern volatile unsigned char           BAUD2CON            __at(0xE9F);
#ifndef _LIB_BUILD
asm("BAUD2CON equ 0E9Fh");
#endif
// aliases
extern volatile unsigned char           BAUDCON2            __at(0xE9F);
#ifndef _LIB_BUILD
asm("BAUDCON2 equ 0E9Fh");
#endif
extern volatile unsigned char           BAUDCTL2            __at(0xE9F);
#ifndef _LIB_BUILD
asm("BAUDCTL2 equ 0E9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN2                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF2                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG162                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL2                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE2                   :1;
    };
} BAUD2CONbits_t;
extern volatile BAUD2CONbits_t BAUD2CONbits __at(0xE9F);
// bitfield macros
#define _BAUD2CON_ABDEN_POSN                                0x0
#define _BAUD2CON_ABDEN_POSITION                            0x0
#define _BAUD2CON_ABDEN_SIZE                                0x1
#define _BAUD2CON_ABDEN_LENGTH                              0x1
#define _BAUD2CON_ABDEN_MASK                                0x1
#define _BAUD2CON_WUE_POSN                                  0x1
#define _BAUD2CON_WUE_POSITION                              0x1
#define _BAUD2CON_WUE_SIZE                                  0x1
#define _BAUD2CON_WUE_LENGTH                                0x1
#define _BAUD2CON_WUE_MASK                                  0x2
#define _BAUD2CON_BRG16_POSN                                0x3
#define _BAUD2CON_BRG16_POSITION                            0x3
#define _BAUD2CON_BRG16_SIZE                                0x1
#define _BAUD2CON_BRG16_LENGTH                              0x1
#define _BAUD2CON_BRG16_MASK                                0x8
#define _BAUD2CON_SCKP_POSN                                 0x4
#define _BAUD2CON_SCKP_POSITION                             0x4
#define _BAUD2CON_SCKP_SIZE                                 0x1
#define _BAUD2CON_SCKP_LENGTH                               0x1
#define _BAUD2CON_SCKP_MASK                                 0x10
#define _BAUD2CON_RCIDL_POSN                                0x6
#define _BAUD2CON_RCIDL_POSITION                            0x6
#define _BAUD2CON_RCIDL_SIZE                                0x1
#define _BAUD2CON_RCIDL_LENGTH                              0x1
#define _BAUD2CON_RCIDL_MASK                                0x40
#define _BAUD2CON_ABDOVF_POSN                               0x7
#define _BAUD2CON_ABDOVF_POSITION                           0x7
#define _BAUD2CON_ABDOVF_SIZE                               0x1
#define _BAUD2CON_ABDOVF_LENGTH                             0x1
#define _BAUD2CON_ABDOVF_MASK                               0x80
#define _BAUD2CON_ABDEN2_POSN                               0x0
#define _BAUD2CON_ABDEN2_POSITION                           0x0
#define _BAUD2CON_ABDEN2_SIZE                               0x1
#define _BAUD2CON_ABDEN2_LENGTH                             0x1
#define _BAUD2CON_ABDEN2_MASK                               0x1
#define _BAUD2CON_ABDOVF2_POSN                              0x7
#define _BAUD2CON_ABDOVF2_POSITION                          0x7
#define _BAUD2CON_ABDOVF2_SIZE                              0x1
#define _BAUD2CON_ABDOVF2_LENGTH                            0x1
#define _BAUD2CON_ABDOVF2_MASK                              0x80
#define _BAUD2CON_BRG162_POSN                               0x3
#define _BAUD2CON_BRG162_POSITION                           0x3
#define _BAUD2CON_BRG162_SIZE                               0x1
#define _BAUD2CON_BRG162_LENGTH                             0x1
#define _BAUD2CON_BRG162_MASK                               0x8
#define _BAUD2CON_RCIDL2_POSN                               0x6
#define _BAUD2CON_RCIDL2_POSITION                           0x6
#define _BAUD2CON_RCIDL2_SIZE                               0x1
#define _BAUD2CON_RCIDL2_LENGTH                             0x1
#define _BAUD2CON_RCIDL2_MASK                               0x40
#define _BAUD2CON_RCMT2_POSN                                0x6
#define _BAUD2CON_RCMT2_POSITION                            0x6
#define _BAUD2CON_RCMT2_SIZE                                0x1
#define _BAUD2CON_RCMT2_LENGTH                              0x1
#define _BAUD2CON_RCMT2_MASK                                0x40
#define _BAUD2CON_SCKP2_POSN                                0x4
#define _BAUD2CON_SCKP2_POSITION                            0x4
#define _BAUD2CON_SCKP2_SIZE                                0x1
#define _BAUD2CON_SCKP2_LENGTH                              0x1
#define _BAUD2CON_SCKP2_MASK                                0x10
#define _BAUD2CON_TXCKP2_POSN                               0x4
#define _BAUD2CON_TXCKP2_POSITION                           0x4
#define _BAUD2CON_TXCKP2_SIZE                               0x1
#define _BAUD2CON_TXCKP2_LENGTH                             0x1
#define _BAUD2CON_TXCKP2_MASK                               0x10
#define _BAUD2CON_WUE2_POSN                                 0x1
#define _BAUD2CON_WUE2_POSITION                             0x1
#define _BAUD2CON_WUE2_SIZE                                 0x1
#define _BAUD2CON_WUE2_LENGTH                               0x1
#define _BAUD2CON_WUE2_MASK                                 0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN2                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF2                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG162                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL2                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE2                   :1;
    };
} BAUDCON2bits_t;
extern volatile BAUDCON2bits_t BAUDCON2bits __at(0xE9F);
// bitfield macros
#define _BAUDCON2_ABDEN_POSN                                0x0
#define _BAUDCON2_ABDEN_POSITION                            0x0
#define _BAUDCON2_ABDEN_SIZE                                0x1
#define _BAUDCON2_ABDEN_LENGTH                              0x1
#define _BAUDCON2_ABDEN_MASK                                0x1
#define _BAUDCON2_WUE_POSN                                  0x1
#define _BAUDCON2_WUE_POSITION                              0x1
#define _BAUDCON2_WUE_SIZE                                  0x1
#define _BAUDCON2_WUE_LENGTH                                0x1
#define _BAUDCON2_WUE_MASK                                  0x2
#define _BAUDCON2_BRG16_POSN                                0x3
#define _BAUDCON2_BRG16_POSITION                            0x3
#define _BAUDCON2_BRG16_SIZE                                0x1
#define _BAUDCON2_BRG16_LENGTH                              0x1
#define _BAUDCON2_BRG16_MASK                                0x8
#define _BAUDCON2_SCKP_POSN                                 0x4
#define _BAUDCON2_SCKP_POSITION                             0x4
#define _BAUDCON2_SCKP_SIZE                                 0x1
#define _BAUDCON2_SCKP_LENGTH                               0x1
#define _BAUDCON2_SCKP_MASK                                 0x10
#define _BAUDCON2_RCIDL_POSN                                0x6
#define _BAUDCON2_RCIDL_POSITION                            0x6
#define _BAUDCON2_RCIDL_SIZE                                0x1
#define _BAUDCON2_RCIDL_LENGTH                              0x1
#define _BAUDCON2_RCIDL_MASK                                0x40
#define _BAUDCON2_ABDOVF_POSN                               0x7
#define _BAUDCON2_ABDOVF_POSITION                           0x7
#define _BAUDCON2_ABDOVF_SIZE                               0x1
#define _BAUDCON2_ABDOVF_LENGTH                             0x1
#define _BAUDCON2_ABDOVF_MASK                               0x80
#define _BAUDCON2_ABDEN2_POSN                               0x0
#define _BAUDCON2_ABDEN2_POSITION                           0x0
#define _BAUDCON2_ABDEN2_SIZE                               0x1
#define _BAUDCON2_ABDEN2_LENGTH                             0x1
#define _BAUDCON2_ABDEN2_MASK                               0x1
#define _BAUDCON2_ABDOVF2_POSN                              0x7
#define _BAUDCON2_ABDOVF2_POSITION                          0x7
#define _BAUDCON2_ABDOVF2_SIZE                              0x1
#define _BAUDCON2_ABDOVF2_LENGTH                            0x1
#define _BAUDCON2_ABDOVF2_MASK                              0x80
#define _BAUDCON2_BRG162_POSN                               0x3
#define _BAUDCON2_BRG162_POSITION                           0x3
#define _BAUDCON2_BRG162_SIZE                               0x1
#define _BAUDCON2_BRG162_LENGTH                             0x1
#define _BAUDCON2_BRG162_MASK                               0x8
#define _BAUDCON2_RCIDL2_POSN                               0x6
#define _BAUDCON2_RCIDL2_POSITION                           0x6
#define _BAUDCON2_RCIDL2_SIZE                               0x1
#define _BAUDCON2_RCIDL2_LENGTH                             0x1
#define _BAUDCON2_RCIDL2_MASK                               0x40
#define _BAUDCON2_RCMT2_POSN                                0x6
#define _BAUDCON2_RCMT2_POSITION                            0x6
#define _BAUDCON2_RCMT2_SIZE                                0x1
#define _BAUDCON2_RCMT2_LENGTH                              0x1
#define _BAUDCON2_RCMT2_MASK                                0x40
#define _BAUDCON2_SCKP2_POSN                                0x4
#define _BAUDCON2_SCKP2_POSITION                            0x4
#define _BAUDCON2_SCKP2_SIZE                                0x1
#define _BAUDCON2_SCKP2_LENGTH                              0x1
#define _BAUDCON2_SCKP2_MASK                                0x10
#define _BAUDCON2_TXCKP2_POSN                               0x4
#define _BAUDCON2_TXCKP2_POSITION                           0x4
#define _BAUDCON2_TXCKP2_SIZE                               0x1
#define _BAUDCON2_TXCKP2_LENGTH                             0x1
#define _BAUDCON2_TXCKP2_MASK                               0x10
#define _BAUDCON2_WUE2_POSN                                 0x1
#define _BAUDCON2_WUE2_POSITION                             0x1
#define _BAUDCON2_WUE2_SIZE                                 0x1
#define _BAUDCON2_WUE2_LENGTH                               0x1
#define _BAUDCON2_WUE2_MASK                                 0x2
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN2                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF2                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG162                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL2                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE2                   :1;
    };
} BAUDCTL2bits_t;
extern volatile BAUDCTL2bits_t BAUDCTL2bits __at(0xE9F);
// bitfield macros
#define _BAUDCTL2_ABDEN_POSN                                0x0
#define _BAUDCTL2_ABDEN_POSITION                            0x0
#define _BAUDCTL2_ABDEN_SIZE                                0x1
#define _BAUDCTL2_ABDEN_LENGTH                              0x1
#define _BAUDCTL2_ABDEN_MASK                                0x1
#define _BAUDCTL2_WUE_POSN                                  0x1
#define _BAUDCTL2_WUE_POSITION                              0x1
#define _BAUDCTL2_WUE_SIZE                                  0x1
#define _BAUDCTL2_WUE_LENGTH                                0x1
#define _BAUDCTL2_WUE_MASK                                  0x2
#define _BAUDCTL2_BRG16_POSN                                0x3
#define _BAUDCTL2_BRG16_POSITION                            0x3
#define _BAUDCTL2_BRG16_SIZE                                0x1
#define _BAUDCTL2_BRG16_LENGTH                              0x1
#define _BAUDCTL2_BRG16_MASK                                0x8
#define _BAUDCTL2_SCKP_POSN                                 0x4
#define _BAUDCTL2_SCKP_POSITION                             0x4
#define _BAUDCTL2_SCKP_SIZE                                 0x1
#define _BAUDCTL2_SCKP_LENGTH                               0x1
#define _BAUDCTL2_SCKP_MASK                                 0x10
#define _BAUDCTL2_RCIDL_POSN                                0x6
#define _BAUDCTL2_RCIDL_POSITION                            0x6
#define _BAUDCTL2_RCIDL_SIZE                                0x1
#define _BAUDCTL2_RCIDL_LENGTH                              0x1
#define _BAUDCTL2_RCIDL_MASK                                0x40
#define _BAUDCTL2_ABDOVF_POSN                               0x7
#define _BAUDCTL2_ABDOVF_POSITION                           0x7
#define _BAUDCTL2_ABDOVF_SIZE                               0x1
#define _BAUDCTL2_ABDOVF_LENGTH                             0x1
#define _BAUDCTL2_ABDOVF_MASK                               0x80
#define _BAUDCTL2_ABDEN2_POSN                               0x0
#define _BAUDCTL2_ABDEN2_POSITION                           0x0
#define _BAUDCTL2_ABDEN2_SIZE                               0x1
#define _BAUDCTL2_ABDEN2_LENGTH                             0x1
#define _BAUDCTL2_ABDEN2_MASK                               0x1
#define _BAUDCTL2_ABDOVF2_POSN                              0x7
#define _BAUDCTL2_ABDOVF2_POSITION                          0x7
#define _BAUDCTL2_ABDOVF2_SIZE                              0x1
#define _BAUDCTL2_ABDOVF2_LENGTH                            0x1
#define _BAUDCTL2_ABDOVF2_MASK                              0x80
#define _BAUDCTL2_BRG162_POSN                               0x3
#define _BAUDCTL2_BRG162_POSITION                           0x3
#define _BAUDCTL2_BRG162_SIZE                               0x1
#define _BAUDCTL2_BRG162_LENGTH                             0x1
#define _BAUDCTL2_BRG162_MASK                               0x8
#define _BAUDCTL2_RCIDL2_POSN                               0x6
#define _BAUDCTL2_RCIDL2_POSITION                           0x6
#define _BAUDCTL2_RCIDL2_SIZE                               0x1
#define _BAUDCTL2_RCIDL2_LENGTH                             0x1
#define _BAUDCTL2_RCIDL2_MASK                               0x40
#define _BAUDCTL2_RCMT2_POSN                                0x6
#define _BAUDCTL2_RCMT2_POSITION                            0x6
#define _BAUDCTL2_RCMT2_SIZE                                0x1
#define _BAUDCTL2_RCMT2_LENGTH                              0x1
#define _BAUDCTL2_RCMT2_MASK                                0x40
#define _BAUDCTL2_SCKP2_POSN                                0x4
#define _BAUDCTL2_SCKP2_POSITION                            0x4
#define _BAUDCTL2_SCKP2_SIZE                                0x1
#define _BAUDCTL2_SCKP2_LENGTH                              0x1
#define _BAUDCTL2_SCKP2_MASK                                0x10
#define _BAUDCTL2_TXCKP2_POSN                               0x4
#define _BAUDCTL2_TXCKP2_POSITION                           0x4
#define _BAUDCTL2_TXCKP2_SIZE                               0x1
#define _BAUDCTL2_TXCKP2_LENGTH                             0x1
#define _BAUDCTL2_TXCKP2_MASK                               0x10
#define _BAUDCTL2_WUE2_POSN                                 0x1
#define _BAUDCTL2_WUE2_POSITION                             0x1
#define _BAUDCTL2_WUE2_SIZE                                 0x1
#define _BAUDCTL2_WUE2_LENGTH                               0x1
#define _BAUDCTL2_WUE2_MASK                                 0x2

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0xEA0);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0EA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0xEA0);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

